Repository: ZhaslanToishybayev/AI_personalization
Catalog: mobile/flutter_app/lib/l10n/arb/app_*.arb
Languages: de, es, ru

# appTitle
source: Personal AI Assistant
de: Persönlicher KI-Assistent
es: Asistente personal de IA
ru: Персональный AI Ассистент

# homeToday
source: Today
de: Heute
es: Hoy
ru: Сегодня

# homeLoadingPlan
source: Fetching your plan...
de: Tagesplan wird geladen...
es: Obteniendo tu plan...
ru: Загружаю ваш план...

# homeSamplePlanTitle
source: Daily plan
de: Tagesplan
es: Plan diario
ru: План на день

# homeSampleGreeting
source: Good morning, Casey
de: Guten Morgen, Casey
es: Buenos días, Casey
ru: Доброе утро, Кейси

# homeSampleSummary
source: Morning focus block at 09:30. Two high-priority follow-ups ready.
de: Fokusblock um 09:30. Zwei dringende Nachverfolgungen bereit.
es: Bloque de enfoque a las 09:30. Dos seguimientos de alta prioridad listos.
ru: Утренний фокус-блок в 09:30. Два приоритетных дела готовы.

# homeSampleAgendaTitle
source: Agenda
de: Tagesordnung
ru: Повестка

# homeSampleSuggestionsTitle
source: Assistant suggestions
de: Assistentenempfehlungen
es: Sugerencias del asistente
ru: Предложения ассистента

# homeSampleFocusTitle
source: Focus tasks
de: Fokustasks
es: Tareas de enfoque
ru: Фокус-задачи

# homeSampleSuggestionHoldSeat
source: Hold seat for Seattle flight
de: Sitzplatz für Seattle-Flug reservieren
es: Reservar asiento para el vuelo a Seattle
ru: Забронировать место на рейс в Сиэтл

# homeSampleSuggestionHoldSeatDetail
source: Flight UA 455 still unconfirmed. Reserve 18:15 departure?
de: Flug UA 455 ist noch nicht bestätigt. Abflug um 18:15 reservieren?
es: El vuelo UA 455 sigue sin confirmarse. ¿Reservar la salida de las 18:15?
ru: Рейс UA 455 всё ещё не подтверждён. Забронировать вылет в 18:15?

# homeSampleSuggestionHoldSeatAction
source: Hold seat
de: Sitzplatz reservieren
es: Reservar asiento
ru: Забронировать место

# homeSampleSuggestionPrep
source: Prepare talking points
de: Gesprächspunkte vorbereiten
es: Preparar puntos de conversación
ru: Подготовить тезисы

# homeSampleSuggestionPrepDetail
source: Review churn metrics before leadership sync.
de: Prüfe die Churn-Metriken vor dem Leadership-Meeting.
es: Revisa las métricas de churn antes de la reunión de liderazgo.
ru: Просмотрите метрики оттока перед созвоном с руководством.

# homeSampleSuggestionPrepAction
source: Open summary
de: Zusammenfassung öffnen
es: Abrir resumen
ru: Открыть сводку

# homeSampleFocusApproval
source: Approve security review summary
de: Zusammenfassung der Sicherheitsprüfung freigeben
es: Aprobar resumen de revisión de seguridad
ru: Утвердить сводку по проверке безопасности

# homeSampleFocusApprovalStatus
source: Due today · Assigned to you
de: Fällig heute · Dir zugewiesen
es: Vence hoy · Asignado a ti
ru: Срок сегодня · Назначено вам

# homeSampleFocusDraft
source: Draft Q3 OKR recap
de: OKR-Rückblick Q3 verfassen
es: Redactar recuento de OKR del T3
ru: Составить итоги OKR за Q3

# homeSampleFocusDraftStatus
source: In progress
de: In Arbeit
es: En progreso
ru: В процессе

# conflictQuietHoursTitle
source: Quiet hours active
de: Ruhezeiten aktiv
es: Horas de silencio activas
ru: Активны тихие часы

# conflictQuietHoursDescription
source: Sending now would break Casey's quiet hours.
de: Senden würde Caseys Ruhezeiten verletzen.
es: Enviar ahora rompería las horas de silencio de Casey.
ru: Отправка сейчас нарушит тихие часы Кейси.

# conflictScheduleStatus
source: Scheduled for {time}
de: Geplant für {time}
es: Programado para {time}
ru: Запланировано на {time}

# conflictOverrideStatus
source: Override sent · user notified
de: Override gesendet · Nutzer benachrichtigt
es: Anulación enviada · usuario notificado
ru: Переопределение отправлено · пользователь уведомлён

# conflictOverrideFailedStatus
source: Override failed · {error}
de: Override fehlgeschlagen · {error}
es: Error al anular · {error}
ru: Переопределение не удалось · {error}

# conflictScheduleAfterQuietHours
source: Schedule after quiet hours
de: Nach Ruhezeiten planen
es: Programar después de las horas de silencio
ru: Запланировать после тихих часов

# conflictScheduleLater
source: Schedule later
de: Später planen
es: Programar más tarde
ru: Запланировать позже

# conflictSendAnyway
source: Send anyway
de: Trotzdem senden
es: Enviar de todas formas
ru: Всё равно отправить

# conflictDismiss
source: Dismiss
de: Schließen
es: Descartar
ru: Отклонить

# conflictContextNote
source: Quiet hours end at {time} in {timeZone}.
de: Ruhezeiten enden um {time} in {timeZone}.
es: Las horas de silencio terminan a las {time} en {timeZone}.
ru: Тихие часы заканчиваются в {time} по часовому поясу {timeZone}.

# commonNext
source: Next
de: Weiter
es: Siguiente
ru: Далее

# commonFinish
source: Finish
de: Fertigstellen
es: Finalizar
ru: Завершить

# commonCancel
source: Cancel
de: Abbrechen
es: Cancelar
ru: Отмена

# commonNone
source: None
de: Keine
es: Ninguno
ru: Нет

# onboardingWelcomeTitle
source: Welcome to Personal AI Assistant
de: Willkommen beim Personal AI Assistant
es: Bienvenido a Asistente Personal de IA
ru: Добро пожаловать в Персональный AI Ассистент

# onboardingWelcomeSubtitle
source: We will personalize your daily support, collect only what you approve, and allow you to adjust anytime.
de: Wir personalisieren deine tägliche Unterstützung, sammeln nur, was du freigibst, und du kannst alles jederzeit anpassen.
es: Personalizaremos tu asistencia diaria, recopilaremos solo lo que apruebes y podrás ajustarlo en cualquier momento.
ru: Мы персонализируем вашу ежедневную поддержку, соберём только те данные, которые вы одобрите, и позволим вам изменить настройки в любое время.

# onboardingGetStarted
source: Get started
de: Loslegen
es: Comenzar
ru: Начать

# onboardingLocaleTitle
source: Set your preferred language
de: Lege deine bevorzugte Sprache fest
es: Configura tu idioma preferido
ru: Выберите предпочитаемый язык

# onboardingLocaleSubtitle
source: Localization helps the assistant tailor phrasing and summaries. You can change it anytime in settings.
de: Die Lokalisierung hilft dem Assistenten, Formulierungen und Zusammenfassungen anzupassen. Du kannst sie jederzeit in den Einstellungen ändern.
es: La localización ayuda al asistente a adaptar el tono y los resúmenes. Puedes cambiarlo en cualquier momento desde ajustes.
ru: Локализация помогает ассистенту адаптировать формулировки и сводки. Вы можете изменить язык в любое время в настройках.

# onboardingChooseLanguage
source: Choose language
de: Sprache wählen
es: Elegir idioma
ru: Выбрать язык

# onboardingLanguageSet
source: Language set to {language}
de: Sprache festgelegt auf {language}
es: Idioma establecido en {language}
ru: Язык установлен: {language}

# onboardingChannelsTitle
source: Choose how you would like to receive updates
de: Wähle, wie du Updates erhalten möchtest
es: Elige cómo quieres recibir las actualizaciones
ru: Выберите, как вы хотите получать обновления

# onboardingCriticalAlertsTitle
source: Allow critical alerts
de: Kritische Hinweise zulassen
es: Permitir alertas críticas
ru: Разрешить критичные уведомления

# onboardingCriticalAlertsSubtitle
source: For urgent conflicts and time-sensitive nudges
de: Für dringende Konflikte und zeitkritische Erinnerungen
es: Para conflictos urgentes y recordatorios sensibles al tiempo
ru: Для срочных конфликтов и напоминаний с ограничением по времени

# onboardingQuietHoursTitle
source: Set quiet hours
de: Ruhezeiten festlegen
es: Configura las horas de silencio
ru: Установить тихие часы

# onboardingQuietHoursSubtitle
source: During quiet hours the assistant will pause non-critical notifications.
de: Während der Ruhezeiten pausiert der Assistent nicht-kritische Benachrichtigungen.
es: Durante las horas de silencio el asistente pausará las notificaciones no críticas.
ru: В тихие часы ассистент приостановит некритичные уведомления.

# onboardingQuietStartLabel
source: Start (HH:MM)
de: Beginn (HH:MM)
es: Inicio (HH:MM)
ru: Начало (ЧЧ:ММ)

# onboardingQuietEndLabel
source: End (HH:MM)
de: Ende (HH:MM)
es: Fin (HH:MM)
ru: Конец (ЧЧ:ММ)

# onboardingAddBoundary
source: Add boundary topic
de: Grenzthema hinzufügen
es: Agregar tema límite
ru: Добавить запретную тему

# onboardingBoundaryHint
source: e.g., finances, personal health
de: z. B. Finanzen, persönliche Gesundheit
es: p. ej., finanzas, salud personal
ru: например, финансы, личное здоровье

# onboardingSaveBoundary
source: Save boundary
de: Grenze speichern
es: Guardar límite
ru: Сохранить границу

# onboardingConsentsTitle
source: Review privacy preferences
de: Datenschutz-Einstellungen prüfen
es: Revisa las preferencias de privacidad
ru: Просмотрите настройки конфиденциальности

# onboardingAcceptTos
source: I agree to the Terms of Service
de: Ich stimme den Nutzungsbedingungen zu
es: Acepto los Términos de Servicio
ru: Я согласен с Условиями использования

# onboardingTelemetryTitle
source: I allow anonymized telemetry
de: Ich erlaube anonymisierte Telemetrie
es: Permito telemetría anonimizada
ru: Я разрешаю анонимную телеметрию

# onboardingTelemetrySubtitle
source: Used to improve assistant performance and reliability
de: Dient zur Verbesserung der Leistung und Zuverlässigkeit des Assistenten
es: Se utiliza para mejorar el rendimiento y la confiabilidad del asistente
ru: Используется для улучшения производительности и надёжности ассистента

# onboardingViewExport
source: View data export options
de: Datenexport-Optionen anzeigen
es: Ver opciones de exportación de datos
ru: Посмотреть варианты экспорта данных

# onboardingExportDetails
source: Export data as JSON or ICS. Delete requests honored within 72 hours.
de: Daten als JSON oder ICS exportieren. Löschanfragen werden innerhalb von 72 Stunden bearbeitet.
es: Exporta datos como JSON o ICS. Las solicitudes de eliminación se procesan en 72 horas.
ru: Экспортировать данные в формате JSON или ICS. Запросы на удаление обрабатываются в течение 72 часов.

# onboardingSummaryTitle
source: You are all set!
de: Alles erledigt!
es: ¡Todo listo!
ru: Всё готово!

# onboardingOfflineBanner
source: Offline mode ready — last plan cached
de: Offline-Modus bereit – letzter Plan zwischengespeichert
es: Modo sin conexión listo: último plan en caché
ru: Офлайн-режим готов — последний план кэширован

# onboardingCriticalAllowed
source: Allowed
de: Zugelassen
es: Permitidas
ru: Разрешено

# onboardingCriticalMuted
source: Muted
de: Stummgeschaltet
es: Silenciadas
ru: Отключено

# onboardingTelemetryEnabled
source: Enabled
de: Aktiviert
es: Activada
ru: Включено

# onboardingTelemetryDisabled
source: Disabled
de: Deaktiviert
es: Desactivada
ru: Отключено

# onboardingSummaryLocale
source: Locale: {locale}
de: Sprache: {locale}
es: Idioma: {locale}
ru: Язык: {locale}

# onboardingSummaryChannels
source: Channels: {channels}
de: Kanäle: {channels}
es: Canales: {channels}
ru: Каналы: {channels}

# onboardingSummaryCritical
source: Critical alerts: {status}
de: Kritische Hinweise: {status}
es: Alertas críticas: {status}
ru: Критичные уведомления: {status}

# onboardingSummaryQuietHours
source: Quiet hours: {start} — {end}
de: Ruhezeiten: {start} — {end}
es: Horas de silencio: {start} — {end}
ru: Тихие часы: {start} — {end}

# onboardingSummaryTelemetry
source: Telemetry: {status}
de: Telemetrie: {status}
es: Telemetría: {status}
ru: Телеметрия: {status}

# onboardingSummaryBoundaries
source: Boundaries: {boundaries}
de: Grenzen: {boundaries}
es: Límites: {boundaries}
ru: Границы: {boundaries}

# onboardingLocaleEnglishLabel
source: English (US)
de: Englisch (USA)
es: Inglés (EE. UU.)

# onboardingLocaleEnglishName
source: English
de: Englisch
es: Inglés
ru: Английский

# onboardingLocaleSpanishLabel
source: Español (LatAm)
de: Spanisch (LatAm)

# onboardingLocaleSpanishName
source: Spanish
de: Spanisch
es: Español
ru: Испанский

# onboardingLocaleGermanName
source: German
de: Deutsch
es: Alemán
ru: Немецкий

# onboardingChannelCalendar
source: Enable Calendar Sync
de: Kalendersynchronisierung aktivieren
es: Activar sincronización con Calendario
ru: Включить синхронизацию календаря

# onboardingChannelGmail
source: Enable Gmail Summaries
de: Gmail-Zusammenfassungen aktivieren
es: Activar resúmenes de Gmail
ru: Включить сводки Gmail

# onboardingChannelPush
source: Push Notifications
de: Push-Benachrichtigungen
es: Notificaciones push
ru: Push-уведомления

# onboardingStepWelcome
source: Welcome
de: Willkommen
es: Bienvenida
ru: Приветствие

# onboardingStepLanguage
source: Language
de: Sprache
es: Idioma
ru: Язык

# onboardingStepChannels
source: Notification channels
de: Benachrichtigungskanäle
es: Canales de notificación
ru: Каналы уведомлений

# onboardingStepQuietHours
source: Quiet hours
de: Ruhezeiten
es: Horas de silencio
ru: Тихие часы

# onboardingStepConsents
source: Privacy consents
de: Zustimmungen
es: Consentimientos
ru: Согласия на конфиденциальность

# onboardingStepSummary
source: Summary
de: Zusammenfassung
es: Resumen
ru: Сводка

# summaryFollowUpsTitle
source: Today's follow-ups
de: Heutige Nachverfolgungen
es: Seguimientos de hoy
ru: Дела на сегодня

# summarySignalsTitle
source: Signals monitored
de: Überwachte Signale
es: Señales monitoreadas
ru: Отслеживаемые сигналы

# summaryOfflineBanner
source: Offline summary cached
de: Offline-Zusammenfassung zwischengespeichert
es: Resumen sin conexión en caché
ru: Офлайн-сводка кэширована

# summaryConfidenceLabel
source: Confidence: {value}
de: Vertrauen: {value}
es: Confianza: {value}
ru: Уверенность: {value}

# summarySourcesCount
source: Sources ({count})
de: Quellen ({count})
es: Fuentes ({count})
ru: Источники ({count})

# summaryViewSources
source: View sources
de: Quellen anzeigen
es: Ver fuentes
ru: Просмотреть источники

# onboardingLocaleGermanLabel
source: Deutsch (DE)
es: Alemán (DE)
